tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
brew "node"
brew "bash-language-server"
brew "bat"
brew "direnv"
brew "dive"
brew "dockerfile-language-server"
brew "duf"
brew "eza"
brew "fd"
brew "fzf"
brew "libpq"
brew "gdal"
brew "git-lfs"
brew "gopass"
brew "helix"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "kanata"
brew "kubernetes-cli"
brew "lazydocker"
brew "libmagic"
brew "lua-language-server"
brew "marksman"
brew "midnight-commander"
brew "minikube"
brew "mole"
brew "ncspot"
brew "postgresql@14"
brew "pre-commit"
brew "pspg"
brew "ripgrep"
brew "rtk"
brew "rust"
brew "rust-analyzer"
brew "stow"
brew "taplo"
brew "tig"
brew "tmux"
brew "uv"
brew "vscode-langservers-extracted"
brew "wireguard-tools"
brew "xcodegen"
brew "yaml-language-server"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "koekeishiya/formulae/skhd"
cask "cursor"
cask "discord"
cask "font-departure-mono"
cask "font-departure-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-nunito"
cask "ghostty"
cask "linearmouse"
vscode "anysphere.cursorpyright"
vscode "astral-sh.ty"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "jasew.vscode-helix-emulation"
vscode "jdinhlife.gruvbox"
vscode "lao-liang.vscode-theme-alabaster-dark"
vscode "metaphore.kanagawa-vscode-color-theme"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "repreng.csv"
vscode "sainnhe.gruvbox-material"
vscode "sobolevn.pustota"
vscode "subframe7536.custom-ui-style"
cargo "rustlings"
uv "pre-commit"
uv "pyright"
uv "ruff"
uv "ty"
